In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

In [19]:
test=pd.read_csv('SalaryData_Test.csv') #loading the data
train=pd.read_csv('SalaryData_Train.csv')

In [20]:
train=pd.merge(test,train)
train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,43,Private,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,50,United-States,>50K
1,43,Private,Masters,14,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,50,United-States,>50K
2,37,Private,HS-grad,9,Widowed,Machine-op-inspct,Unmarried,White,Female,0,0,20,United-States,<=50K
3,25,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,<=50K
4,25,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,<=50K

In [21]:
train.describe()

               age  educationno   capitalgain  capitalloss  hoursperweek
count  5910.000000  5910.000000   5910.000000  5910.000000   5910.000000
mean     32.815059     9.774450     49.204738     2.436548     38.545516
std      10.892922     1.675096   1433.023789    71.195428      7.456800
min      17.000000     1.000000      0.000000     0.000000      8.000000
25%      23.000000     9.000000      0.000000     0.000000     40.000000
50%      32.000000     9.000000      0.000000     0.000000     40.000000
75%      40.000000    10.000000      0.000000     0.000000     40.000000
max      67.000000    16.000000  99999.000000  2415.000000     85.000000

In [22]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5910 entries, 0 to 5909
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            5910 non-null   int64
 1   workclass      5910 non-null   object
 2   education      5910 non-null   object
 3   educationno    5910 non-null   int64
 4   maritalstatus  5910 non-null   object
 5   occupation     5910 non-null   object
 6   relationship   5910 non-null   object
 7   race           5910 non-null   object
 8   sex            5910 non-null   object
 9   capitalgain    5910 non-null   int64
 10  capitalloss    5910 non-null   int64
 11  hoursperweek   5910 non-null   int64
 12  native         5910 non-null   object
 13  Salary         5910 non-null   object
dtypes: int64(5), object(9)
memory usage: 484.8+ KB

In [23]:
from sklearn import preprocessing 
label_encoder = preprocessing.LabelEncoder()

In [24]:
train['workclass'].unique()

array([' Private', ' Local-gov', ' Self-emp-inc', ' Federal-gov',
       ' Self-emp-not-inc', ' State-gov'], dtype=object)

In [25]:
train.education.unique()

array([' Masters', ' HS-grad', ' Bachelors', ' Some-college',
       ' Assoc-voc', ' Assoc-acdm', ' 11th', ' 1st-4th', ' 7th-8th',
       ' 10th', ' Prof-school', ' 5th-6th', ' 12th', ' Doctorate', ' 9th',
       ' Preschool'], dtype=object)

In [26]:
train.education.unique()

array([' Masters', ' HS-grad', ' Bachelors', ' Some-college',
       ' Assoc-voc', ' Assoc-acdm', ' 11th', ' 1st-4th', ' 7th-8th',
       ' 10th', ' Prof-school', ' 5th-6th', ' 12th', ' Doctorate', ' 9th',
       ' Preschool'], dtype=object)

In [27]:
train.relationship.unique()

array([' Husband', ' Unmarried', ' Own-child', ' Not-in-family', ' Wife',
       ' Other-relative'], dtype=object)

In [28]:
train.race.unique()

array([' White', ' Black', ' Asian-Pac-Islander'], dtype=object)

In [29]:
train.sex.unique()

array([' Male', ' Female'], dtype=object)

In [30]:
train.native.unique()

array([' United-States', ' Mexico', ' Jamaica', ' Philippines'],
      dtype=object)

In [33]:
#label encoding
train['workclass']= label_encoder.fit_transform(train['workclass'])
train['education']= label_encoder.fit_transform(train['education'])
train['occupation']= label_encoder.fit_transform(train['occupation'])
train['relationship']= label_encoder.fit_transform(train['relationship'])
train['race']= label_encoder.fit_transform(train['race'])
train['sex']=label_encoder.fit_transform(train['sex'])
train['native']=label_encoder.fit_transform(train['native'])
train['maritalstatus']=label_encoder.fit_transform(train['maritalstatus'])

In [34]:
train.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,43,2,12,14,1,2,0,2,1,0,0,50,3,>50K
1,43,2,12,14,1,2,0,2,1,0,0,50,3,>50K
2,37,2,11,9,4,5,4,2,0,0,0,20,3,<=50K
3,25,2,9,13,1,7,0,2,1,0,0,40,3,<=50K
4,25,2,9,13,1,7,0,2,1,0,0,40,3,<=50K

In [35]:
#checking dtypes
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5910 entries, 0 to 5909
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            5910 non-null   int64
 1   workclass      5910 non-null   int32
 2   education      5910 non-null   int32
 3   educationno    5910 non-null   int64
 4   maritalstatus  5910 non-null   int32
 5   occupation     5910 non-null   int32
 6   relationship   5910 non-null   int32
 7   race           5910 non-null   int32
 8   sex            5910 non-null   int32
 9   capitalgain    5910 non-null   int64
 10  capitalloss    5910 non-null   int64
 11  hoursperweek   5910 non-null   int64
 12  native         5910 non-null   int32
 13  Salary         5910 non-null   object
dtypes: int32(8), int64(5), object(1)
memory usage: 484.8+ KB

In [37]:
#spliting the data
X_train, X_test = train_test_split(train, test_size = 0.25, random_state = 0)

In [39]:
X_train = X_train.iloc[:,:-1]
y_train = X_train.iloc[:,-1]
X_test =  X_test.iloc[:,:-1]
y_test = X_test.iloc[:,-1]

In [40]:
X_train

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native
1285,36,2,15,10,1,1,0,2,1,0,0,40,3
4062,34,2,11,9,0,1,1,2,1,0,0,40,3
5692,33,2,11,9,1,1,0,2,1,0,0,45,3
689,36,2,11,9,1,1,0,2,1,0,0,40,3
4320,21,2,15,10,2,1,1,2,1,0,0,40,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4931,54,2,12,14,1,7,0,2,1,0,0,40,3
3264,18,2,15,10,2,9,3,2,0,0,0,15,3
1653,50,2,11,9,1,1,0,2,1,0,0,40,3
2607,36,2,15,10,0,0,4,2,0,0,0,40,3
2732,29,2,11,9,1,1,0,2,1,0,0,40,3

In [41]:
y_train

1285    3
4062    3
5692    3
689     3
4320    3
       ..
4931    3
3264    3
1653    3
2607    3
2732    3
Name: native, Length: 4432, dtype: int32

In [43]:
#scaling
from sklearn.preprocessing import StandardScaler
standardsaler=StandardScaler()
X_train = standardsaler.fit_transform(X_train)
X_test = standardsaler.transform(X_test)

In [53]:
#Importing the models
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB as MB
from sklearn.metrics import confusion_matrix

In [54]:
GB = GaussianNB()

In [56]:
#ModelBuilding 
model = GB.fit(X_train,y_train)

In [63]:
#Predicting
pred=model.predict(X_test)
pred

array([3, 3, 3, ..., 3, 3, 3])

In [58]:
#Gaussiannb_model
confusion_matrix(y_test,pred)

array([[   0,    8],
       [   0, 1470]], dtype=int64)

In [60]:
#Confusion_matrix 
pd.crosstab(y_test.values.flatten(),pred)

col_0     3
row_0
1         8
3      1470

In [62]:
#Model_Accuracy
np.mean(pred==y_test.values.flatten())

0.9945872801082544